000000 IDENTIFICATION DIVISION.
000000 PROGRAM-ID. AcceptYear.
000000 ENVIRONMENT DIVISION.
000000 DATA DIVISION.
000000 WORKING-STORAGE SECTION.
000000
000000*    閏年計算したい西暦
000000 1   InputString PIC X(5).
000000
000000 LINKAGE SECTION.
000000
000000 1   AcceptKind PIC 9(2).
000000 1   AcceptString PIC 9(4).
000000
000000 PROCEDURE DIVISION USING AcceptKind, AcceptString.
000000 MAIN.
000000
000000     COMPUTE AcceptKind = 20.
000000
000000     DISPLAY "閏年計算したい西暦を入力して下さい".
000000     ACCEPT InputString.
000000
000000     CALL "ValidateAcceptYear" USING AcceptKind, InputString.
000000
000000     IF AcceptKind NOT= 0 THEN
000000         EXIT PROGRAM
000000     END-IF.
000000
000000     MOVE InputString TO AcceptString.
000000
000000     EXIT PROGRAM.

