000000 IDENTIFICATION DIVISION.
000000 PROGRAM-ID. DisplayYearKind.
000000 ENVIRONMENT DIVISION.
000000 DATA DIVISION.
000000 WORKING-STORAGE SECTION.
000000
000000 1   YearString PIC X(4).
000000
000000 LINKAGE SECTION.
000000
000000 1   YearKind PIC 9(2).
000000
000000 PROCEDURE DIVISION USING YearKind.
000000 MAIN.
000000
000000     IF YearKind = 10 THEN
000000         MOVE "平年" TO YearString
000000     ELSE
000000         MOVE "閏年" TO YearString
000000     END-IF.
000000
000000     DISPLAY "入力した西暦は" YearString "です。".
000000
000000     EXIT PROGRAM.

