000000 IDENTIFICATION DIVISION.
000000 PROGRAM-ID. IsEmptyAcceptVarchar.
000000 ENVIRONMENT DIVISION.
000000 DATA DIVISION.
000000
000000 WORKING-STORAGE SECTION.
000000
000000
000000 LINKAGE SECTION.
000000
000000 1   IsEmpty PIC 9.
000000 1   Target PIC X.
000000
000000 PROCEDURE DIVISION USING IsEmpty, Target.
000000 MAIN.
000000
000000     COMPUTE IsEmpty = 0.
000000
000000     IF Target = X"0D" THEN
000000         COMPUTE IsEmpty = 1
000000     END-IF.
000000
000000     EXIT PROGRAM.
