000000 IDENTIFICATION DIVISION.
000000 PROGRAM-ID. IsNgPatternAccept5Varchar.
000000 ENVIRONMENT DIVISION.
000000 DATA DIVISION.
000000
000000 WORKING-STORAGE SECTION.
000000
000000 1   StringLength PIC 9.
000000
000000 LINKAGE SECTION.
000000
000000 1   Result PIC 9.
000000 1   Target PIC X(5).
000000
000000 PROCEDURE DIVISION USING Result, Target.
000000 MAIN.
000000     COMPUTE Result = 1.
000000
000000     COMPUTE StringLength =
000000         FUNCTION STORED-CHAR-LENGTH(Target) - 1.
000000
000000     IF Target(1: StringLength) IS NUMERIC THEN
000000         COMPUTE Result = 0
000000     END-IF
000000
000000     EXIT PROGRAM.
