000000 IDENTIFICATION DIVISION.
000000 PROGRAM-ID. FutureBabyMama.
000000 ENVIRONMENT DIVISION.
000000 DATA DIVISION.
000000 WORKING-STORAGE SECTION.
000000
000000*    閏年計算したい西暦
000000 1   Year PIC 9(4).
000000
000000 PROCEDURE DIVISION.
000000 MAIN.
000000
000000     COMPUTE RETURN-CODE = 999.
000000
000000     DISPLAY "閏年計算したい西暦を入力して下さい".
000000     ACCEPT Year.
000000
000000     IF RETURN-CODE = 999 AND FUNCTION MOD(Year, 400) = 0 THEN
000000         COMPUTE RETURN-CODE = 10
000000     END-IF.
000000
000000     IF RETURN-CODE = 999 AND FUNCTION MOD(Year, 100) = 0 THEN
000000         COMPUTE RETURN-CODE = 0
000000     END-IF.
000000
000000     IF RETURN-CODE = 999 AND FUNCTION MOD(Year, 4) = 0 THEN
000000         COMPUTE RETURN-CODE = 10
000000     END-IF.
000000
000000     IF RETURN-CODE = 10 THEN
000000         DISPLAY "入力した西暦は閏年です。"
000000         STOP RUN
000000     END-IF.
000000
000000     COMPUTE RETURN-CODE = 0
000000     DISPLAY "入力した西暦は平年です。"
000000
000000
000000     STOP RUN.
