000000 IDENTIFICATION DIVISION.
000000 PROGRAM-ID. ToYearKind.
000000 ENVIRONMENT DIVISION.
000000 DATA DIVISION.
000000
000000 WORKING-STORAGE SECTION.
000000
000000*    閏年計算のためのパラメーター
000000 1   Algorithms.
000000 2       Element OCCURS 3.
000000 3           Divisions PIC 9(3).
000000 3           Results PIC 9(2).
000000
000000*    ループカウンタ
000000 1   LoopIndex PIC 9.
000000 1   LoopCount PIC 9.
000000
000000 LINKAGE SECTION.
000000
000000 1   YearKind PIC 9(2).
000000 1   Year PIC 9(4).
000000
000000 PROCEDURE DIVISION USING YearKind, Year.
000000 MAIN.
000000
000000     COMPUTE Divisions(1) = 4.
000000     COMPUTE Results(1) = 10.
000000     COMPUTE Divisions(2) = 100.
000000     COMPUTE Results(2) = 0.
000000     COMPUTE Divisions(3) = 400.
000000     COMPUTE Results(3) = 10.
000000
000000     COMPUTE LoopCount =
000000         FUNCTION LENGTH(Algorithms) /
000000         FUNCTION LENGTH(Element(1)).
000000
000000     PERFORM VARYING LoopIndex FROM 1 BY 1
000000         UNTIL LoopIndex > LoopCount
000000
000000         IF FUNCTION MOD(Year, Divisions(LoopIndex)) NOT = 0 THEN
000000             COMPUTE YearKind = Results(LoopIndex)
000000             EXIT PROGRAM
000000         END-IF
000000     END-PERFORM.
000000
000000     EXIT PROGRAM.
